// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Russian (`ru`).
class AppLocalizationsRu extends AppLocalizations {
  AppLocalizationsRu([String locale = 'ru']) : super(locale);

  @override
  String get onboardingSkip => 'Пропустить';

  @override
  String get onboardingTitleOne => 'Сканирование и расшифровка';

  @override
  String get onboardingDescOne =>
      'Наведите камеру, чтобы открыть\nистории артефактов и мгновенно перевести\nдревние иероглифы.';

  @override
  String get onboardingTitleTwo => 'Поговорите с историей';

  @override
  String get onboardingDescTwo =>
      'Ведите настоящие беседы с артефактами.\nЗадавайте вопросы и слушайте их\nскрытые секреты.';

  @override
  String get onboardingTitleThree => 'Исследуйте мифы';

  @override
  String get onboardingDescThree =>
      'Погрузитесь в эпохи и мифологию\nДревнего Египта. Ваше путешествие начинается\nпрямо сейчас.';

  @override
  String get onboardingGetStarted => 'Начать';

  @override
  String get onboardingNext => 'Далее';

  @override
  String get drawerHome => 'Главная';

  @override
  String get drawerDiscover => 'Открытие';

  @override
  String get drawerScan => 'Сканировать';

  @override
  String get drawerChat => 'Чат';

  @override
  String get drawerProfile => 'Профиль';

  @override
  String get drawerSettings => 'Настройки';

  @override
  String get homeSliderDescOne => 'На базе\n*коллекции\nБЕМ*.';

  @override
  String get homeSliderDescTwo =>
      'Наша модель ИИ в настоящее\nвремя посвящена\nартефактам\n*Большого Египетского\nмузея*.';

  @override
  String get homeScanButton =>
      'Сканировать артефакты и\nрасшифровывать иероглифы';

  @override
  String get homeHistoryTitle => 'История Египта\nи эпохи';

  @override
  String get homeMythologyTitle => 'Мифология и\nбоги';

  @override
  String get discoverTitle => 'Исследовать';

  @override
  String get discoverHistoryTitle => 'История Египта и эпохи';

  @override
  String get discoverMythologyTitle => 'Мифология и боги';

  @override
  String get discoverHistoryButton => 'Исследовать династии';

  @override
  String get discoverMythologyButton => 'Войти в Пантеон';

  @override
  String get readMore => 'Читать далее';

  @override
  String get showless => 'Показывать меньше';

  @override
  String get era1Title => 'Додинастический и Раннединастический периоды';

  @override
  String get era1Desc =>
      'Додинастический и Раннединастический периоды (ок. 3200 – 2686 гг. до н.э.)\nИстория цивилизации началась, когда жители долины Нила собрались в двух главных центрах: регионе Дельты (Северное царство) и городе \"Иераконполь\" в Верхнем Египте (Южное царство). На Юге появился Нармер (Менес), последний царь Додинастического периода, который вторгся на Север, чтобы впервые объединить страну около 3150 г. до н.э. Нармер зафиксировал эту великую победу на \"Палетке Нармера\", где он изображен в короне Юга с одной стороны и короне Севера с другой, основав Первую династию. Для обеспечения централизованного контроля и управления зарождающейся бюрократией он основал столицу \"Мемфис\". Ему наследовал царь \"Хор-Аха\", и Вторая династия продолжила укреплять столпы государства.';

  @override
  String get era2Title => 'Древнее царство';

  @override
  String get era2Desc =>
      'Эпоха строителей пирамид (2686 – 2181 гг. до н.э.)\nТретья династия стала свидетелем архитектурного скачка, когда царь Джосер и его архитектор Имхотеп построили первое в истории гигантское каменное сооружение (Ступенчатую пирамиду в Саккаре). С приходом Четвертой династии Снофру воздвиг настоящие пирамиды в Мейдуме и Дахшуре. Затем его сын Хуфу (Хеопс) построил Великую пирамиду в Гизе, которая тысячелетиями оставалась самым высоким зданием в мире. Она была построена египетскими рабочими — которые трудились в обмен на освобождение от налогов и еду, а не как рабы. В Пятой династии Усеркаф сосредоточился на строительстве солнечных храмов в Абусире. Однако к концу Шестой династии престиж царской власти начал падать, и среди правителей провинций усилилась тенденция к независимости.';

  @override
  String get era3Title => 'Первый переходный период';

  @override
  String get era3Desc =>
      'Первый переходный период (2181 – 2055 гг. до н.э.)\nПосле краха Древнего царства Египет вошел в темный туннель, где центральная власть полностью отступила. Преобладали хаос и политическая нестабильность, до такой степени, что эта эпоха описывалась фразами, указывающими на изобилие царей и их короткое правление (династии с 9 по 11), что привело к повсеместной социальной тревоге.';

  @override
  String get era4Title => 'Среднее царство';

  @override
  String get era4Desc =>
      'Эпоха процветания (2055 – 1650 гг. до н.э.)\nЕдинство вернулось на египетские земли на заре Одиннадцатой династии благодаря принцам Фив. Царю Ментухотепу II удалось воссоединить страну и построить свой заупокойный храм в Дейр-эль-Бахри. Двенадцатая династия стала периодом стабильности и процветания, когда такие цари, как Аменемхет I и Сенусерт II, осуществляли ирригационные проекты и строили относительно меньшие пирамиды (по сравнению с Древним царством) в Лиште, Лахуне и Хаваре в Файюме.';

  @override
  String get era5Title => 'Второй переходный период';

  @override
  String get era5Desc =>
      'Вторжение гиксосов (1650 – 1550 гг. до н.э.)\nЦарская власть снова отступила, что позволило \"гиксосам\" (кочевым скотоводческим племенам) воспользоваться этой слабостью и доминировать в Северном Египте и Дельте с помощью боевых колесниц. Гиксосы основали свою столицу в \"Аварисе\", в то время как правление коренных египтян ограничилось Югом. Этот период египтяне не стремились подробно документировать из-за горечи поражения.';

  @override
  String get era6Title => 'Новое царство';

  @override
  String get era6Desc =>
      'Эпоха Империи (1550 – 1069 гг. до н.э.)\nЭта славная эпоха началась с того, что царь Яхмос изгнал гиксосов и основал Восемнадцатую династию. Египет расширился в военном отношении; Тутмос I вторгся в Нубию, а Тутмос III (Наполеон древности) возглавил кампании, достигшие реки Евфрат в Сирии. Царица Хатшепсут приобрела известность, построив храм в Дейр-эль-Бахри; ее правление ознаменовалось строительством и процветанием. Религиозная и художественная революция произошла, когда Аменхотеп IV (Эхнатон) заменил старых богов поклонением \"Атону\" и перенес столицу в \"Телль-эль-Амарну\". Однако его сын Тутанхамон вернул столицу в Фивы и восстановил старую религию. В Девятнадцатой династии Сети I, а затем его сын Рамсес II столкнулись с хеттскими войсками. Конфликт завершился битвой при Кадеше и первым в истории мирным договором. Рамсес построил массивные монументы (Абу-Симбел). Слава империи закончилась при Рамсесе III (Двадцатая династия), который отразил нападение \"народов моря\", после чего последовал упадок при царях-Рамессидах.';

  @override
  String get era7Title => 'Третий переходный период';

  @override
  String get era7Desc =>
      'Третий переходный период (1069 – 664 гг. до н.э.)\nЕгипет оказался политически разделенным; новая династия правила из \"Таниса\" в Дельте, в то время как верховные жрецы Амона контролировали Фивы на Юге. Страна распалась на небольшие государства, что позволило правителям Куша (нубийцам) взять под контроль Верхний Египет, вторгнуться в Мемфис и основать Двадцать пятую династию.';

  @override
  String get era8Title => 'Поздний период';

  @override
  String get era8Desc =>
      'Поздний период (664 – 332 гг. до н.э.)\nНесмотря на постоянные войны, в этот период наблюдались вспышки культурного возрождения (Двадцать шестая династия). Египет столкнулся с ассирийским вторжением, затем вернулась Тридцатая династия как последняя коренная египетская династия, возглавляемая Нектанебом I и Нектанебом II, которые построили храмы на острове Филе. Правление коренных египтян навсегда закончилось после того, как Нектанеб II потерпел поражение от персов в битве при Пелузии (343 г. до н.э.), что во второй раз сделало Египет персидской провинцией.';

  @override
  String get era9Title => 'Греко-римский период';

  @override
  String get era9Desc =>
      'Греко-римский период (332 г. до н.э. – 30 г. до н.э.)\nВ 332 г. до н.э. Александр Македонский вошел в Египет, положив конец персидскому правлению. После его смерти Птолемей I основал царство Птолемеев. Правление Птолемеев продолжалось до эпохи Клеопатры VII, которая вступила в борьбу за трон, закончившуюся прибытием Юлия Цезаря, а затем Октавиана (Августа). Октавиан победил ее и захватил Александрию в 30 г. до н.э., официально превратив Египет в римскую провинцию, что ознаменовало постепенное угасание древнеегипетского языка и культуры.';

  @override
  String get god1Title => 'Хроники Нила:\nОт хаоса к порядку';

  @override
  String get god1Desc =>
      'I. Рассвет света\nВ начале, до начала времен, был только Нун, хаотичный, бесконечный океан темной воды. Из глубин этой бездны поднялся великий пирамидальный холм, и на его вершине покоился цветок лотоса. Когда лепестки распустились, они обнажили ослепительное сияние, изгнавшее тьму. Это был Ра, бог Солнца и источник всей жизни.\n\nОдинокий в своем великолепии, Ра породил первое поколение богов: Шу (Воздух) и Тефнут (Дождь). Но вселенная была огромна и полна воды, и его дети затерялись в темных течениях. Опечаленный, Ра послал свое око в образе богини Хатхор, чтобы найти их. Когда они вернулись, Ра заплакал слезами чистой радости. Когда эти божественные слезы упали на землю, они превратились в первых людей.\n\nРа, первый фараон, правил во время золотого века. Он подарил человечеству реку Нил, сердцебиение существования. Однако шли эпохи, и Ра постарел. Человечество, видя, как угасает его сила, восстало. В гневе Ра выпустил львицу Сехмет, чтобы наказать их, почти уничтожив человечество в потопе крови, прежде чем Ра проявил милосердие. Устав от смертного мира, Ра вознесся на небеса. Каждый день он плыл по небу в своей солнечной ладье, а каждую ночь спускался в Подземный мир, чтобы сразиться со змеем хаоса Апопом, гарантируя, что солнце снова взойдет.\n\nII. Золотой век Осириса\nКогда Ра вознесся на небеса, правление землей перешло к его внукам: Осирису и Исиде, а также Сету и Нефтиде.\n\nОсирис воссел на трон Египта, благосклонный и мудрый царь. Он принес человечеству цивилизацию, научив их ткать, печь хлеб, устанавливать законы и возделывать землю. Под его правлением процветал мир. Однако в тени скрывался его брат, Сет.\n\nВ то время как Осирис правил плодородной долиной, Сет был владыкой засушливых, палящих пустынь. Ревность разъедала сердце Сета — не только из-за власти его брата, но и из-за тайной связи Осириса с женой Сета, Нефтидой, от которой родился Анубис, бог с головой шакала.\n\nIII. Предательский пир\nОхваченный завистью, Сет спланировал темную месть. Он устроил роскошный пир в честь Осириса. В центре зала он выставил великолепный гроб, сделанный из кедра и золота. \"Этот сундук, — объявил Сет со злой улыбкой, — достанется тому, кому он идеально подойдет по размеру.\"\n\nОдин за другим гости пробовали, но это была ловушка, предназначенная только для Царя. Когда Осирис лег внутрь, Сет и его сообщники захлопнули крышку, запечатали ее расплавленным свинцом и бросили в Нил. Добрый Царь утонул, и эпоха невинности закончилась.\n\nИсида, охваченная горем, искала своего мужа по всему миру. Она нашла его, но злобный Сет украл тело и разрубил его на 14 частей, разбросав их по всему Египту. С помощью Анубиса Исида нашла все части (кроме одной) и провела первые обряды мумификации. Осирис воскрес, но больше не мог жить в стране живых. Он спустился, чтобы стать Владыкой мертвых, оставив трон Египта пустым.\n\nIV. Война дяди и племянника\nСет узурпировал трон, погрузив Египет в царство террора и тьмы. Но Исида родила сына от своего воскресшего мужа: Гора, бога-сокола.\n\nСкрываемый в болотах до совершеннолетия, Гор в конце концов вышел вперед, чтобы потребовать свое право по рождению. Он бросил вызов своему дяде, начав войну, которая продлилась 80 лет. Конфликт был жестоким. В своих битвах они превращались в бегемотов, чтобы посмотреть, кто сможет дольше оставаться под водой; они сражались в небесах и в песках. В какой-то момент Сет вырвал глаз Гора (который был восстановлен Хатхор), а Гор унизил Сета, обманом заставив его проглотить свое божественное семя, спрятанное в листьях салата.\n\nТрибунал богов, на котором председательствовал Ра, устал от хаоса. Хотя Ра изначально благоволил Сету за его силу в защите солнечной ладьи от змея Апопа, нельзя было отрицать справедливость притязаний Гора.\n\nV. Равновесие: Черная земля и Красная земля\nНаконец, боги вынесли свой вердикт. Гор был коронован как законный Царь, отомстив за своего отца.\nОднако египетское мировоззрение строилось на Маат — равновесии. Полное уничтожение одной из сторон не было путем космоса. Мир был разделен между двумя могущественными богами:\n\nГору было дано владычество над Кеметом, \"Черной землей\". Это была плодородная почва по берегам Нила, где росли урожаи, процветала цивилизация и жили люди. Он олицетворял порядок, рост и сердце Египта.\n\nСет не был уничтожен, но ему было дано владычество над Пустынями, \"Красной землей\". Несмотря на свою суровость, его сила была необходима. Он стал яростным защитником границ Египта, охраняя царство от иноземных захватчиков и продолжая каждую ночь плыть на лодке Ра, чтобы убить змея хаоса Апопа.\n\nVI. Коронация\nС того дня фараоны Египта рассматривались как живое воплощение Гора. Тем не менее, они признавали необходимость силы Сета.\n\nВ качестве последнего акта космической гармонии было установлено, что и Гор, и Сет будут символически короновать каждого нового Фараона. В ритуалах коронации, изображенных на стенах храмов, Сокол и Зверь стоят по обе стороны от нового Царя, вместе возлагая корону на его голову. Это символизировало то, что истинный правитель должен овладеть как плодородным миром Черной земли, так и свирепой, хаотичной мощью Красной земли, чтобы сохранить Египет суверенным и сильным.';

  @override
  String get god2Title => 'Атум';

  @override
  String get god2Subtitle => 'Творец';

  @override
  String get god2Desc =>
      'В начале времен был только Нун, первозданные воды хаоса. Из великого потока внутри этих вод поднялся бог солнца Атум и усилием воли сотворил себя. Он создал первую божественную пару: Шу (воздух) и Тефнут (влага). Они, в свою очередь, породили Геба (землю) и Нут (небо), от которых произошли четверо братьев и сестер: Осирис, Исида, Сет и Нефтида, завершив божественную группу, известную как Эннеада.';

  @override
  String get god3Title => 'Осирис';

  @override
  String get god3Subtitle => 'Царь мертвых';

  @override
  String get god3Desc =>
      'Осирис был любимым царем, который правил Египтом вместе со своей сестрой-женой Исидой во время беспрецедентного периода мира и процветания. Однако его ревнивый брат Сет убил его, расчленил тело и разбросал куски по всей земле. После того как Исида нашла его тело, Осирис воскрес, но был слишком слаб, чтобы оставаться в мире живых. Он отправился в Дуат (Подземный мир), чтобы стать Владыкой мертвых. Там он председательствует на страшном суде, оценивая, достойны ли души войти в загробную жизнь.';

  @override
  String get god4Title => 'Исида';

  @override
  String get god4Subtitle => 'Великая Мать и Волшебница';

  @override
  String get god4Desc =>
      'Считавшаяся самой важной богиней Египта, Исида была женой Осириса и матерью Гора. После убийства мужа она искала его разбросанные останки и с помощью Анубиса и Тота собрала его, создав первую мумию. Она сбежала, чтобы спрятать своего сына Гора от Сета, воспитывая его в тайне. Исида славилась своей могущественной магией, которую использовала для исцеления людей и защиты царства. Ее магия была настолько сильна, что однажды она создала змею, чтобы укусить Ра, заставив его раскрыть свое тайное имя для исцеления, что значительно увеличило ее силу.';

  @override
  String get god5Title => 'Сет';

  @override
  String get god5Subtitle => 'Бог хаоса и пустыни';

  @override
  String get god5Desc =>
      'Известный как \"Красный\", Сет олицетворял гнев, насилие и засушливую пустыню (\"Красная земля\"), которая угрожала жизни. Он убил своего брата Осириса, чтобы узурпировать трон, что привело к жестокому конфликту с его племянником Гором. Несмотря на то, что он был антагонистом и олицетворял гражданские беспорядки и иностранные вторжения, Сет играл решающую роль в космическом порядке. Каждую ночь он путешествовал на солнечной барке Ра через подземный мир, будучи единственным богом, способным отразить змея Апопа своим копьем, чтобы защитить солнце.';

  @override
  String get god6Title => 'Гор';

  @override
  String get god6Subtitle => 'Царь-Сокол';

  @override
  String get god6Desc =>
      'Сын Исиды и Осириса, Гор — бог царской власти. Он воспитывался в тайне, пока не стал достаточно взрослым, чтобы бросить вызов своему дяде Сету. После жестокого состязания и божественного суда под председательством Геба Гор был объявлен законным царем Египта. Считалось, что фараоны являются живым воплощением Гора. Он представлялся космическим соколом: его правый глаз был солнцем, левый — луной, а взмахи его крыльев порождали ветры.';

  @override
  String get god7Title => 'Ра';

  @override
  String get god7Subtitle => 'Бог Солнца';

  @override
  String get god7Desc =>
      'Ра был главным из богов, а его тело считалось самим солнцем. Он создал человека из своих слез. Он правил как первый Царь на земле, пока не состарился и не вознесся на небеса на спине богини неба Нут. Ра проходит ежедневный цикл:\nХепри: Жук-скарабей, катящий солнце вверх на рассвете.\nРа: Полуденное солнце, плывущее по небу.\nАтум: Заходящее солнце. Ночью он путешествует по подземному миру, сражаясь со змеем Апопом, чтобы снова возродиться на рассвете.';

  @override
  String get god8Title => 'Амон';

  @override
  String get god8Subtitle => 'Сокрытый';

  @override
  String get god8Desc =>
      'Амон был невидимой силой, стоящей за всеми вещами. В отличие от других богов, связанных с конкретными стихиями, Амон был универсальным богом. На протяжении истории он поглощал других богов, наиболее заметно слившись с Ра, чтобы стать Амоном-Ра. В этой форме он стал Царем Богов и главным божеством Египта.';

  @override
  String get god9Title => 'Анубис';

  @override
  String get god9Subtitle => 'Страж гробниц';

  @override
  String get god9Desc =>
      'Бог бальзамирования с головой шакала. Он помог Исиде запеленать Осириса, создав первую мумию. Анубис охранял гробницы, наказывал расхитителей гробниц и руководил ритуалами бальзамирования. В загробной жизни он играет ключевую роль в Чертоге Маат. Он управляет весами, взвешивая сердце умершего против \"Пера Истины\". Если сердце было чистым, душа переходила к Осирису; если оно было отягощено грехами, его пожирало чудовище Аммат.';

  @override
  String get god10Title => 'Тот';

  @override
  String get god10Subtitle => 'Бог мудрости и письма';

  @override
  String get god10Desc =>
      'Лунный бог письма, знаний и равновесия. Некоторые мифы гласят, что он родился изо лба Сета. Тот исцелил глаз Гора после того, как тот был ранен в бою. Он изобрел искусство письма и служил писцом богов, записывая божественные слова и правления фараонов. В Зале Суда он стоит у весов, чтобы записать вердикт взвешивания сердца.';

  @override
  String get god11Title => 'Птах';

  @override
  String get god11Subtitle => 'Творец-ремесленник';

  @override
  String get god11Desc =>
      'Бог-покровитель Мемфиса и ремесленников. Мемфисская теология утверждала, что Птах был создателем мира, вызывая вселенную к существованию с помощью мысли и слова (задумав ее в своем сердце и произнеся языком). Он рассматривался как скульптор, сформировавший землю на гончарном круге.';

  @override
  String get god12Title => 'Сехмет';

  @override
  String get god12Desc =>
      'Львица войны и огня. Ра послал ее, чтобы наказать мятежных людей, и ее гнев был настолько велик, что она чуть не уничтожила человечество.';

  @override
  String get god13Title => 'Бастет';

  @override
  String get god13Desc =>
      'Изначально львица, позже она стала богиней-кошкой. Она защищала беременных женщин и Фараона, продолжая при этом помогать Ра в борьбе с Апопом.';

  @override
  String get god14Title => 'Хатхор';

  @override
  String get god14Desc =>
      'Богиня-корова любви, материнства и музыки. Она приветствовала мертвых в загробной жизни.';

  @override
  String get god15Title => 'Нейт';

  @override
  String get god15Desc =>
      'Богиня-воительница и мать (мать бога-крокодила Себека). Она была мастером-лучником и фигурой творца.';

  @override
  String get settings => 'Настройки';

  @override
  String get settingsAppPreferences => 'Настройки приложения';

  @override
  String get settingsLanguage => 'Язык';

  @override
  String get settingsLightMood => 'Светлая тема';

  @override
  String get settingsCameraPermission => 'Разрешение на камеру';

  @override
  String get settingsSupportAbout => 'Поддержка и О приложении';

  @override
  String get settingsPrivacyPolicy => 'Политика конфиденциальности';

  @override
  String get settingsLogOut => 'Выйти';

  @override
  String get language => 'Язык';

  @override
  String get english => 'Английский';

  @override
  String get arabic => 'Арабский';

  @override
  String get french => 'Французский';

  @override
  String get german => 'Немецкий';

  @override
  String get spanish => 'Испанский';

  @override
  String get chinese => 'Китайский';

  @override
  String get russian => 'Русский';

  @override
  String get italian => 'Итальянский';

  @override
  String get japanese => 'Японский';

  @override
  String get korean => 'Корейский';

  @override
  String get portuguese => 'Португальский';

  @override
  String get appLanguage => 'Язык приложения';

  @override
  String get aboutTitle => 'О приложении Echo';

  @override
  String get aboutSubtitle => 'Где древние шепоты обретают современный голос';

  @override
  String get aboutPhilosophyTitle => 'Философия Echo';

  @override
  String get aboutPhilosophyBody =>
      'История — это больше, чем просто даты и пыльные камни; это сердцебиение цивилизации, которая отказалась быть забытой. На протяжении тысячелетий истории наших предков существовали в виде \"шепота\", вырезанного на стенах храмов и звучащего в залах наших музеев.\n\nEcho родился из простой, но глубокой миссии: дать этим шепотам современный голос.\n\nМы верим, что для того, чтобы по-настоящему понять артефакт, нужно смотреть за пределы его физической формы и погружаться в дух его создателей: их священную мифологию, их ритмичный язык и вечные верования, которые сформировали мир.';

  @override
  String get aboutMoreTitle => 'Больше, чем просто приложение';

  @override
  String get aboutMoreBody =>
      'Наше путешествие было не просто написанием кода; оно было посвящено заново открытию египетской души. Мы тщательно собрали нити нашего наследия, чтобы предложить вам более глубокую связь с прошлым:\n\n• Мудрость мифологии: Исследование историй богов и философии загробной жизни.\n• Сила языка: Преодоление разрыва между древними надписями и современным пониманием.\n• Глубина истории: Раскрытие человеческих историй, стоящих за каждой статуей и памятником.';

  @override
  String get aboutBridgeTitle => 'Мост в завтрашний день';

  @override
  String get aboutBridgeBody =>
      'Хотя наши сердца укоренены в древнем мире, наши инструменты созданы в современную эпоху. Мы используем технологии как мост, не для того, чтобы заменить историю, а чтобы осветить ее. Объединяя передовой ИИ и интерактивный дизайн, мы позволяем прошлому заговорить вновь, гарантируя, что наследие Египта продолжит находить отклик у будущих поколений.';

  @override
  String get aboutTeamTitle => 'Команда';

  @override
  String get aboutTeamBody =>
      'Мы — команда студентов старших курсов факультета компьютеров и информации Тантского университета, преданных делу сохранения нашего наследия с помощью инноваций.';

  @override
  String get profileFavorite => 'Избранное';

  @override
  String get profileScan => 'Сканы';

  @override
  String get profileAuthMessage =>
      'Войдите или зарегистрируйтесь, чтобы создать профиль';

  @override
  String get profileNoFavorites => 'Пока нет избранного';

  @override
  String get profileNoScans => 'Пока нет сканов';

  @override
  String get editProfileTitle => 'Редактировать профиль';

  @override
  String get editProfileName => 'Имя';

  @override
  String get editProfileSave => 'Сохранить изменения';

  @override
  String get editProfileChangeCover => 'Изменить обложку';

  @override
  String get editProfileChangeAvatar => 'Изменить фото';

  @override
  String get authWelcomeBack => 'С возвращением';

  @override
  String get authSubtitleDefault => 'Войдите в свою учетную запись';

  @override
  String get authEmailHint => 'Адрес электронной почты';

  @override
  String get authPasswordHint => 'Пароль';

  @override
  String get authContinue => 'Продолжить';

  @override
  String get authRegister => 'Зарегистрироваться';

  @override
  String get authLogin => 'Войти';

  @override
  String get registerTitle => 'Создать аккаунт';

  @override
  String get registerNameHint => 'Полное имя';

  @override
  String get registerPhoneHint => 'Номер телефона';

  @override
  String get registerLanguageHint => 'Предпочитаемый язык';

  @override
  String get registerConfirmPasswordHint => 'Подтвердите пароль';

  @override
  String get registerCreateAccount => 'Создать аккаунт';

  @override
  String get registerPasswordMismatch => 'Пароли не совпадают';

  @override
  String get authOr => 'ИЛИ';

  @override
  String get authGoogle => 'Продолжить с Google';

  @override
  String get authApple => 'Продолжить с Apple';

  @override
  String get authMicrosoft => 'Продолжить с Microsoft';

  @override
  String get authPhone => 'Продолжить с телефоном';

  @override
  String get authGuestPrompt =>
      'Не хотите использовать все преимущества учетной записи?';

  @override
  String get authContinueGuest => 'Продолжить как гость';

  @override
  String get authStayLoggedOut => 'Оставаться без входа';

  @override
  String get authEmailRequired => 'Пожалуйста, введите свой email';

  @override
  String get authEmailInvalid => 'Пожалуйста, введите действительный email';

  @override
  String get authPasswordRequired => 'Пожалуйста, введите пароль';

  @override
  String get authPasswordTooShort =>
      'Пароль должен состоять минимум из 8 символов';

  @override
  String get networkError =>
      'Ошибка сети. Пожалуйста, проверьте ваше соединение.';

  @override
  String get socialComingSoon => 'Социальный вход скоро появится!';

  @override
  String get profileUpdatedSuccessfully => 'Профиль успешно обновлен!';

  @override
  String get scanTitle => 'Сканируйте артефакты и расшифровывайте иероглифы';

  @override
  String get scanSubtitle =>
      'Сфотографируйте любой древнеегипетский артефакт, чтобы определить его и перевести его иероглифы.';

  @override
  String get scanTakePhoto => 'Сделать фото';

  @override
  String get scanPickGallery => 'Выбрать из галереи';

  @override
  String get scanAnalyzeArtifact => 'Анализировать артефакт';

  @override
  String get scanDifferentPhoto => 'Выбрать другое фото';

  @override
  String get scanAnalyzing => 'Анализ вашего артефакта...';

  @override
  String get scanAnalyzingWait => 'Это может занять до минуты';

  @override
  String get scanSaveFavorites => 'Сохранить в избранное';

  @override
  String get scanRemoveFavorites => 'Удалить из избранного';

  @override
  String get scanNewScan => 'Новый скан';

  @override
  String get scanChat => 'Чат';

  @override
  String get scanHieroglyphs => 'Иероглифы';

  @override
  String get scanAddedToFavorites => 'Добавлено в избранное!';

  @override
  String get scanRemovedFromFavorites => 'Удалено из избранного';

  @override
  String get scanFavorited => 'В избранном';

  @override
  String get scanSave => 'Сохранить';

  @override
  String get scanNoHieroglyphs => 'В этом артефакте не обнаружено иероглифов.';

  @override
  String get scanNoArtifactFound =>
      'Не удалось распознать артефакт на этом изображении.';

  @override
  String get scanHieroglyphsTranslation => 'Перевод иероглифов';

  @override
  String get scanDetails => 'Детали';

  @override
  String get scanRevealTranslation => 'Показать перевод';

  @override
  String get scanHideTranslation => 'Скрыть перевод';

  @override
  String get scanLanguage => 'Язык';

  @override
  String get scanNoArtifactRecognized =>
      'На изображении не распознан артефакт.';

  @override
  String get scanRescan => 'Пересканировать';

  @override
  String get scanTryAgain => 'Попробовать снова';

  @override
  String scanStatLines(int count) {
    String _temp0 = intl.Intl.pluralLogic(
      count,
      locale: localeName,
      other: '$count строк',
      one: '1 строка',
    );
    return '$_temp0';
  }

  @override
  String scanStatGlyphs(int count) {
    String _temp0 = intl.Intl.pluralLogic(
      count,
      locale: localeName,
      other: '$count иероглифов',
      one: '1 иероглиф',
    );
    return '$_temp0';
  }

  @override
  String scanStatCartouches(int count) {
    String _temp0 = intl.Intl.pluralLogic(
      count,
      locale: localeName,
      other: '$count картушей',
      one: '1 картуш',
    );
    return '$_temp0';
  }

  @override
  String get scanStep1 => 'Инициализация нейронного сканирования...';

  @override
  String get scanStep2 => 'Изоляция областей с иероглифами...';

  @override
  String get scanStep3 => 'Анализ градиентов контрастности...';

  @override
  String get scanStep4 => 'Расшифровка иероглифических форм...';

  @override
  String get scanStep5 => 'Перевод древних значений...';

  @override
  String get detailsTitle => 'Детали';

  @override
  String get detailsAboutThisArtifact => 'Об этом артефакте';

  @override
  String get detailsRevealTranslation => 'Показать перевод';

  @override
  String get detailsHideTranslation => 'Скрыть перевод';

  @override
  String get detailsTranslationReveals => 'Узнайте, что раскрывает перевод...';

  @override
  String get detailsUnknownArtifact => 'Артефакт';

  @override
  String get detailsDescription => 'Описание';

  @override
  String get detailsChatWithMe => 'Поговорить со мной';

  @override
  String get errorNoInternet => 'Нет подключения к интернету';

  @override
  String get errorServerError => 'Произошла ошибка сервера';

  @override
  String get errorStorageError => 'Произошла ошибка хранения';

  @override
  String get errorUnexpected => 'Что-то пошло не так';

  @override
  String get errorTimeout => 'Время ожидания истекло';

  @override
  String get errorSessionExpired => 'Сессия истекла. Пожалуйста, войдите снова';

  @override
  String get errorResourceNotFound => 'Ресурс не найден';

  @override
  String get errorRequestFailed => 'Запрос не удался';

  @override
  String get errorRequestCancelled => 'Запрос был отменен';

  @override
  String get errorSecurityError => 'Произошла ошибка безопасности';

  @override
  String get chatHintMessage => 'Сообщение...';

  @override
  String get chatWelcomeMessage => 'Спросите меня о Древнем Египте...';

  @override
  String get chatSearchHint => 'Поиск';

  @override
  String get chatNewChat => 'Новый чат';

  @override
  String get chatDeleteConfirm => 'Удалить сессию?';

  @override
  String get chatDeleteConfirmDesc => 'Это удалит все сообщения в этой сессии.';

  @override
  String get noRouteDefined => 'Не указан маршрут для';

  @override
  String get updatingLanguage => 'Обновление языка...';

  @override
  String get profileTitle => 'Профиль';

  @override
  String get profileGuest => 'Гость';

  @override
  String get profileUnknownArtifact => 'Неизвестный артефакт';

  @override
  String get profileUnknownEra => 'Неизвестная эпоха';

  @override
  String get profileStartScanning => 'Начать сканирование';

  @override
  String get timeAgoJustNow => 'только что';

  @override
  String timeAgoMinute(int count) {
    String _temp0 = intl.Intl.pluralLogic(
      count,
      locale: localeName,
      other: '$count мин. назад',
      one: '1 мин. назад',
    );
    return '$_temp0';
  }

  @override
  String timeAgoHour(int count) {
    String _temp0 = intl.Intl.pluralLogic(
      count,
      locale: localeName,
      other: '$count ч. назад',
      one: '1 ч. назад',
    );
    return '$_temp0';
  }

  @override
  String timeAgoDay(int count) {
    String _temp0 = intl.Intl.pluralLogic(
      count,
      locale: localeName,
      other: '$count д. назад',
      one: '1 д. назад',
    );
    return '$_temp0';
  }
}
